<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of EtreCheck and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.dmmueller.autopkg-recipes.munki.EtreCheck</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>EtreCheck</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>optional</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>EtreCheck</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
	        <key>category</key>
	        <string>Utility</string>
			<key>description</key>
			<string>EtreCheck is a simple little app to display the important details of your system configuration and allow you to copy that information to the Clipboard. Visit http://www.etresoft.com/etrecheck</string>
			<key>display_name</key>
			<string>EtreCheck</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>developer</key>
			<string>Etresoft</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.dmmueller.autopkg-recipes.download.EtreCheck</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
